package pages.dzo.regress;

public enum Dzo {
    // Gargil("Gargill.ru"), Отсутствует дочерний компонент
//    Francia("АлтайскийКрай"),
//    Herbapol("Herbapol"),
    Euroday("АВВА"),
    Apexmed("СПб 21"),
    Fotochem("АЗТ"),
    Ilsanta("МинскинтеркапсБелоруссияЗдоровье");
//    Gland("АЗРИКраснодар"),
////    Fotochem("АЗТ"),
//    delivery("АвРусватаРязаньех"),
//    Jordan("БелмедпрепаратыБелоруссия"),
//    General("БиокорПенза срБиотэкМосква"),
////    Genpharm("БиосенсорМосковская"),
//    Goedecke("БифилюксМосква МелигенЛенинградская"),
//    Helsinnecs(" ГАК \"СкопинфармРязанскаяализованные Островы Мерцана\" "),
////    InTec("ДК МинскинтеркапсБелоруссияТройка"),
//    // GrindstoneGreenmate("ДолфинНовосибирск на Леовит"),
//    Group("ЗигСИЛМАМосквад"),
//    Grunenthal("ИльмиксГруппМосква Ламинарные"),
//    Groupe("ИммунопрепаратБашкортостан БиодезМосковская БиннофармМосква ДДДМосква"),
//    Guiliny("ИнтекорМосква"),
////    Innotech("Канонфарма МинскинтеркапсБелоруссияАлтайвитаминыАлтайскийа"),
//    //    Handok("КиТАлтайский"),
//    Hankintatukku("КомбиотехМосква"),
//    Hachetzi("КузбассоргхимКемерово МедбиофармКалуга"),
////    sm("Купер"),
//    Heinz("ЛекарьИжевск"),
////    Gulf("ЛикомЯрославль МедбиофармКалуга, Казанская"),
//    // Hospira("МедминипромМосква-Алина"),
//    Jafferiee("МедтексМосква ПолисинтезБелгород"),
//    Helsinndevices("МерцанаДевайсы"),
//    //    sber("МеталлпластизделиеМосква"), // есть ошибка в схеме
//    Hermes("МинскинтеркапсБелоруссия А"),
//    //  Himalaya("МинскинтеркапсБелоруссия АлтайвитаминыАлтайский (Альпина)"), Отсутсвует дочерний компонент
//    Hisamitsu("МинскинтеркапсБелоруссия Бизнес Планета"),
//    Heterotech(" МинскинтеркапсБелоруссияАвРусватаРязаньех "),
//    // Intas("инскинтеркапсБелоруссияАлтайвитаминыАлтайский - РеамедСамара"), Отсутсвует дочерний компонент
//    Hoechst("МинскинтеркапсБелоруссияАлтайвитаминыАлтайский Гигровата"),
//    // Indus("МинскинтеркапсБелоруссияАлтайвитаминыАлтайский ЗдоровьеМосковская"), Присутствует две схемы
//    Industria(" МинскинтеркапсБелоруссияАлтайвитаминыАлтайский ПромомедМосква Борисовский СК "),
//    //Impfstoffwerke("МинскинтеркапсБелоруссияАлтайвитаминыАлтайский ПромомедМосква СК"), Присутствует две схемы
//    Herbion("МинскинтеркапсБелоруссияАналитика"),
//    // Jugoremedia("МинскинтеркапсБелоруссияВерофармМосква"), Отсутсвует дочерний компонент
////    Fujisawa("МинскинтеркапсБелоруссияВерофармМосква Бизнес"),
//    Indofarma("МинскинтеркапсБелоруссияДоктор"),
////    Gensia("МинскинтеркапсБелоруссияЕАктиваМосква"),
//    // Heliomed("МинскинтеркапсБелоруссияЕвропа"), Отсутсвует дочерний компонент
//    Iromedica("МинскинтеркапсБелоруссияЗиОинг"),
//    Inbiotech("МинскинтеркапсБелоруссияИнтегро"),
//    //Iskra("МинскинтеркапсБелоруссияЛогистика"),
//    ItalfarmacoR("МинскинтеркапсБелоруссияМегаЗиОМединфортРостов"),
//    Infar("МинскинтеркапсБелоруссияМедИИ"),
//    // Infar("МинскинтеркапсБелоруссияМедИИ"), Отсутсвует дочерний компонент
//    Infusia("МинскинтеркапсБелоруссияМобайл"),
//    // Innovite("МинскинтеркапсБелоруссияМосква"), Отсутсвует дочерний компонент
//    Innovite("МинскинтеркапсБелоруссияОстров"),
//    Instytut("МинскинтеркапсБелоруссияРадугаСИЛМАМосква"),
////    Intendis("МинскинтеркапсБелоруссияСантаМосковская"),
//    //  Hygiene(" МинскинтеркапсБелоруссияСахамедпромРеспублика "), Отсутсвует дочерний компонент
//    Instituto("МинскинтеркапсБелоруссияСпасибо"),
//    Ipsen(" ООО \"Парафарм АлтайвитаминыАлтайский\" "),
//    ICM("ПИПВЭ Сибирское НедвижиИнварМоскваи"),
//    Jadran("ПКФ"),
//    Isis("ПЛЕЗАМосква"),
////    insomnia("ПарафармАлтайвитаминыАлтайский"),
////    Galenika("ПептекМосква"),
//    Irwin("Пептос ДинамикаНовосибирск"),
//    Jelfa("ПроМедРостовская КрасфармаКрасноярск Групп"),
//    Jeyson("ПробаМосква"),
//    // Henkel("Пчела АмфитаМосква МинскинтеркапсБелоруссияАлтайвитаминыАлтайскийа"), Поменялась схема на svg
//    Henry("СБ Биоком"),
//    // Apexmed("СПб 21"), Поменялась схема на svg
//    // Gerot("СантэфармЧелябинск ДиафармМосковская КурскмедстеклоКурск"), Отсутсвует дочерний компонент
//    GFR("СинтезКурган-Ап"),
//    Garnier("СкопинфармРязанская Камелия Севернаяовых Островов"),
//    Gemini(" СкопинфармРязанская РеплекФарм АлтайвитаминыАлтайскийротства "),
//    Genfa("Смирнов РеамедСамара"),
//    Jasol("СолстекМосковская");
//    Jouveinal("Средства");
//    Ilsanta("МинскинтеркапсБелоруссияЗдоровье");

    private String dzoName;

    Dzo(String dzoName) {
        this.dzoName = dzoName;
    }

    public String getDzoName() {
        return dzoName;
    }
}
